# TypeId2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyMemberDifferentType..::..TypeId2 Property
AssemblyMemberDifferentType Class See Also
---
Type id of the second assembly member
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId TypeId2 { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TypeId2 As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ TypeId2 {
	ElementId^ get ();
}
```

# See Also
AssemblyMemberDifferentType Class
Autodesk.Revit.DB Namespace